tests/ycsb/results/bw_bench_20260417_001923/phase1_load.txt
/usr/bin/java  -classpath /tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/conf:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/lib/core-0.17.0.jar:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/tmp/redis-cxl-bench-8079/tests/ycsb/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -s -P /tmp/redis-cxl-bench-8079/tests/ycsb/workloads/workload_bw_saturate -p recordcount=1000000 -p fieldlength=10240 -p redis.host=127.0.0.1 -p redis.port=6379 -p threadcount=16
Command line: -load -db site.ycsb.db.RedisClient -s -P /tmp/redis-cxl-bench-8079/tests/ycsb/workloads/workload_bw_saturate -p recordcount=1000000 -p fieldlength=10240 -p redis.host=127.0.0.1 -p redis.port=6379 -p threadcount=16
YCSB Client 0.17.0

Loading workload...
Starting test.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-04-17 00:19:26:924 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2026-04-17 00:19:36:900 10 sec: 77732 operations; 7773.2 current ops/sec; est completion in 1 minute [INSERT: Count=77736, Max=1155071, Min=230, Avg=2045.67, 90=2681, 99=9551, 99.9=19583, 99.99=1090559] 
2026-04-17 00:19:46:901 20 sec: 142500 operations; 6476.8 current ops/sec; est completion in 2 minutes [INSERT: Count=64777, Max=55327, Min=182, Avg=2464.56, 90=3933, 99=12151, 99.9=23903, 99.99=43647] 
2026-04-17 00:19:56:900 30 sec: 216362 operations; 7386.2 current ops/sec; est completion in 1 minute [INSERT: Count=73866, Max=39359, Min=129, Avg=2162.73, 90=2745, 99=10319, 99.9=19503, 99.99=32063] 
2026-04-17 00:20:06:900 40 sec: 286652 operations; 7029 current ops/sec; est completion in 1 minute [INSERT: Count=70285, Max=47999, Min=155, Avg=2273.33, 90=3353, 99=10439, 99.9=29023, 99.99=41631] 
2026-04-17 00:20:16:899 50 sec: 338785 operations; 5213.3 current ops/sec; est completion in 1 minute [INSERT: Count=52131, Max=49311, Min=115, Avg=3065.45, 90=5223, 99=20255, 99.9=38239, 99.99=45855] 
2026-04-17 00:20:26:899 60 sec: 420890 operations; 8210.5 current ops/sec; est completion in 1 minute [INSERT: Count=82101, Max=75263, Min=123, Avg=1947.01, 90=2491, 99=8051, 99.9=17663, 99.99=71039] 
2026-04-17 00:20:36:899 70 sec: 483206 operations; 6231.6 current ops/sec; est completion in 1 minute [INSERT: Count=62313, Max=46463, Min=115, Avg=2565.08, 90=3365, 99=11191, 99.9=28079, 99.99=45727] 
2026-04-17 00:20:46:899 80 sec: 546760 operations; 6355.4 current ops/sec; est completion in 1 minute [INSERT: Count=63556, Max=582143, Min=132, Avg=2515.53, 90=3293, 99=11231, 99.9=36447, 99.99=579583] 
2026-04-17 00:20:56:899 90 sec: 618895 operations; 7213.5 current ops/sec; est completion in 56 seconds [INSERT: Count=72163, Max=47679, Min=122, Avg=2215.61, 90=2825, 99=10455, 99.9=24431, 99.99=41791] 
2026-04-17 00:21:06:899 100 sec: 692478 operations; 7358.3 current ops/sec; est completion in 45 seconds [INSERT: Count=73553, Max=89855, Min=125, Avg=2172.42, 90=2843, 99=9303, 99.9=25903, 99.99=82815] 
2026-04-17 00:21:16:899 110 sec: 742907 operations; 5042.9 current ops/sec; est completion in 39 seconds [INSERT: Count=50429, Max=77247, Min=194, Avg=3167.51, 90=4375, 99=14335, 99.9=31503, 99.99=73791] 
2026-04-17 00:21:26:900 120 sec: 813174 operations; 7026.7 current ops/sec; est completion in 28 seconds [INSERT: Count=70266, Max=67967, Min=116, Avg=2274.86, 90=2745, 99=11791, 99.9=24751, 99.99=66047] 
2026-04-17 00:21:36:902 130 sec: 880021 operations; 6684.7 current ops/sec; est completion in 18 seconds [INSERT: Count=66846, Max=51455, Min=148, Avg=2389.19, 90=3775, 99=10023, 99.9=25055, 99.99=48639] 
2026-04-17 00:21:46:900 140 sec: 912877 operations; 3285.6 current ops/sec; est completion in 14 seconds [INSERT: Count=32859, Max=107711, Min=282, Avg=4868.21, 90=6683, 99=25135, 99.9=74303, 99.99=92351] 
2026-04-17 00:21:56:899 150 sec: 943319 operations; 3044.2 current ops/sec; est completion in 10 seconds [INSERT: Count=30438, Max=111295, Min=272, Avg=5244.99, 90=7639, 99=36863, 99.9=90751, 99.99=109055] 
2026-04-17 00:22:06:900 160 sec: 972930 operations; 2961.1 current ops/sec; est completion in 5 second [INSERT: Count=29625, Max=107071, Min=287, Avg=5399.59, 90=7867, 99=22399, 99.9=79039, 99.99=96895] 
2026-04-17 00:22:15:733 168 sec: 1000000 operations; 3064.64 current ops/sec; [CLEANUP: Count=16, Max=498943, Min=202, Avg=68251.75, 90=86015, 99=498943, 99.9=498943, 99.99=498943] [INSERT: Count=27056, Max=89343, Min=278, Avg=4818.88, 90=6743, 99=21391, 99.9=69567, 99.99=88447] 
[OVERALL], RunTime(ms), 168833
[OVERALL], Throughput(ops/sec), 5923.01268117015
[TOTAL_GCS_G1_Young_Generation], Count, 173
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 1414
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.8375139931174592
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 173
[TOTAL_GC_TIME], Time(ms), 1414
[TOTAL_GC_TIME_%], Time(%), 0.8375139931174592
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 68251.75
[CLEANUP], MinLatency(us), 202
[CLEANUP], MaxLatency(us), 498943
[CLEANUP], 95thPercentileLatency(us), 473599
[CLEANUP], 99thPercentileLatency(us), 498943
[INSERT], Operations, 1000000
[INSERT], AverageLatency(us), 2686.487986
[INSERT], MinLatency(us), 115
[INSERT], MaxLatency(us), 1155071
[INSERT], 95thPercentileLatency(us), 5959
[INSERT], 99thPercentileLatency(us), 13023
[INSERT], Return=OK, 1000000